//=============================================================================
//
// スコア処理 [TimeFrame.h]
// Author : Ozaki
//
//=============================================================================
#ifndef _TIMEFRAME_H_
#define _TIMEFRAME_H_

#include "main.h"

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitTimeFrame(void);
void UninitTimeFrame(void);
void UpdateTimeFrame(void);
void DrawTimeFrame(void);

#endif

