//=============================================================================
//
// 背景の処理 [Titlebg.cpp]
// Author : Ozaki
//
//=============================================================================
#pragma once
#ifndef _TITLEBG_H_
#define _TITLEBG_H_


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitTitlebg(void);
void UninitTitlebg(void);
void UpdateTitlebg(void);
void DrawTitlebg(void);

#endif // _BG_H_
