//=============================================================================
//
// 背景の処理 [Title.cpp]
// Author : Ozaki
//
//=============================================================================
#pragma once
#ifndef _Title_H_
#define _Title_H_

#include "main.h"
//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitTitle(void);
void UninitTitle(void);
void UpdateTitle(void);
void DrawTitle(void);

#endif // _Title_H_

