//=============================================================================
//
// チュートリアルの処理 [tutorial.cpp]
// Author : Ozaki
//
//=============================================================================
#pragma once
#ifndef _tutorial_H_
#define _tutorial_H_


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void Inittutorial(void);
void Uninittutorial(void);
void Updatetutorial(void);
void Drawtutorial(void);

#endif // _tutorial_H_

