//=============================================================================
//
// ライト処理 [light.h]
// Author : Ozaki
//
//=============================================================================
#ifndef _LIGHT_H_
#define _LIGHT_H_

#include "main.h"

//*****************************************************************************
// クラス宣言
//*****************************************************************************
class CLight
{
public:
	CLight();
	~CLight();

	HRESULT Init(void);
	void	Uninit(void);
	void	Update(void);

private:

	D3DLIGHT9 m_light[3];								//ライトの情報
};

#endif