//=============================================================================
//
// 背景の処理 [PauseBG.cpp]
// Author : Ozaki
//
//=============================================================================
#pragma once
#ifndef _PauseBG_H_
#define _PauseBG_H_


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitPauseBG(void);
void UninitPauseBG(void);
void UpdatePauseBG(void);
void DrawPauseBG(void);

#endif // _PauseBG_H_
