//=============================================================================
//
// 背景の処理 [Result.cpp]
// Author : Ozaki
//
//=============================================================================
#pragma once
#ifndef _Result_H_
#define _Result_H_


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitResult(void);
void UninitResult(void);
void UpdateResult(void);
void DrawResult(void);

#endif // _Result_H_

