//=============================================================================
//
// ポリゴン処理 [wall.h]
// Author : Ozaki
//
//=============================================================================
#ifndef _WALL_H_
#define _WALL_H_

#include "main.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define		MAX_WALL	(126)

//*****************************************************************************
// 構造体
//*****************************************************************************
typedef enum
{
	WallType_000,
	WallType_001,

}WallType;

typedef struct
{
	D3DXVECTOR3 pos;							// 位置
	D3DXVECTOR3 rot;							// 向き
	D3DXMATRIX mtxWorld;						// ワールドマトリックス
	//WallType	type;
	float fRadius;						// 半径(大きさ)
	float fHeght;						// 高さ
	float fWidth;						// 幅
	bool		bUse;								// 使用してるかしてないか

}Wall;

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitWall(void);
void UninitWall(void);
void UpdateWall(void);
void DrawWall(void);
void SetWall(D3DXVECTOR3 posWall, D3DXVECTOR3 rotWall);
#endif
